// *++
//
// Copyright (c) 2005 - 2006, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   LoadPciRomStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell loadpcirom command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"

#string STR_LOADPCIROM_ZERO_LENGTH			#language eng  "%HLoadPciRom%N: Argument with zero length is not allowed\n"

#string STR_LOADPCIROM_CANNOT_OPEN			#language eng  "%HLoadPciRom%N: Cannot open %hs - %r\n"

#string STR_LOADPCIROM_FIRST_ARG_MULTS		#language eng  "%HLoadPciRom%N: First argument cannot be multiple files\n"

#string STR_LOADPCIROM_FIRST_ARG_NOT_DIR	#language eng  "%HLoadPciRom%N: First argument cannot be a directory\n"

#string STR_LOADPCIROM_OUT_OF_MEM			#language eng  "%HLoadPciRom%N: Out of memory\n"

#string STR_LOADPCIROM_READ_ERROR			#language eng  "%HLoadPciRom%N: Read %hs error - %r\n"

#string STR_LOADPCIROM_IMAGE_LOADED			#language eng  "%HloadPciRom%N: Image %hs loaded - %r\n"

#string STR_LOADPCIROM_IMAGE_CORRUPT		#language eng  "%HLoadPciRom%N: Image # %hd is corrupt\n"

#string STR_LOADPCIROM_DECOMP_NOT_FOUND		#language eng  "%HLoadPciRom%N: Decompress protocol interface not found\n"

#string STR_LOADPCIROM_LOAD_IMAGE_ERROR		#language eng  "%HLoadPciRom%N: Load image #%hd error - %r\n"

#string STR_LOADPCIROM_START_IMAGE			#language eng  "%HLoadPciRom%N: Start image #%hd error - %r\n"

#string STR_HELPINFO_LOADPCIROM_SYNTAX		#language eng  "%HLoadPciRom%N [-nc] romfile [romfile…]\n"

#string STR_HELPINFO_LOADPCIROM_LINEHELP    #language eng "Loads a PCI Option ROM"

#string STR_HELPINFO_LOADPCIROM_VERBOSEHELP #language eng "Loads a PCI Option ROM from the specified file.\n"
	                                                      "\n"
	                                                      "%HLoadPciRom%N [-nc] romfile [romfile...]\n"
	                                                      "\n"
	                                                      "    -nc      - Load the ROM image but do not connect the driver\n"
	                                                      "    romfile  - PCI option ROM image file (wildcards are permitted)\n"
